app/controllers/student_controller.rb

  def admission1
    @student = Student.new(params[:student])
    @contactlog = ContactLog.new(params[:contactlog])
    # Hardcode the nationality into the student's nationality field as Chinese
    @student.nationality_id = 36;
    @selected_value = Configuration.default_country
    @application_sms_enabled = SmsSetting.find_by_settings_key("ApplicationEnabled")
    @last_admitted_student = Student.find(:last)
    @config = Configuration.find_by_config_key('AdmissionNumberAutoIncrement')
    @categories = StudentCategory.active
    if request.post?
      if @config.config_value.to_i == 1
        @exist = Student.find_by_admission_no(params[:student][:admission_no])
        if @exist.nil?
          @contactlog.admission_no = @student.admission_no
          @status = @student.save & @contactlog.save
---
SELECT * FROM `sms_settings` WHERE (`sms_settings`.`settings_key` = 'ApplicationEnabled') LIMIT 1
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT `students`.id FROM `students` WHERE (`students`.`admission_no` = BINARY 'Student4') LIMIT 1
INSERT INTO `contact_logs` (`contact_date`, `contact_staff_name`, `discussion_notes`, `admission_no`) VALUES('2009-04-01 00:00:00', '', '', 'Student4')
INSERT INTO `students` (`middle_name`, `student_category_id`, `immediate_contact_id`, `birth_place`, `blood_group`, `city`, `status_description`, `updated_at`, `has_paid_fees`, `course_name`, `recommended_course_notes`, `language`, `interested_course_names`, `gender`, `religion`, `pin_code`, `photo_content_type`, `admission_date`, `last_name`, `created_at`, `user_id`, `school_name`, `first_assessment_notes`, `parent_advice_notes`, `phone1`, `phone2`, `photo_data`, `chinese_name`, `school_grade`, `address_line1`, `address_line2`, `is_active`, `referral_source_type`, `country_id`, `email`, `admission_no`, `first_name`, `batch_id`, `date_of_birth`, `state`, `is_sms_enabled`, `is_deleted`, `photo_file_size`, `referral_source_subtype`, `class_roll_no`, `nationality_id`, `photo_file_name`, `referral_source_promotion`) VALUES(NULL, NULL, NULL, NULL, NULL, '', NULL, '2014-04-01 06:36:20', 0, NULL, '', NULL, NULL, 'm', NULL, '', NULL, '2014-04-01', 'waoiehg', '2014-04-01 06:36:20', 54, NULL, '', '', '', NULL, NULL, '', NULL, '', '', 1, '', 36, '', 'Student4', 'woaiehg', 1, '2009-04-01', '', 1, 0, NULL, '', NULL, 36, NULL, '')

  def admission2
    @student = Student.find params[:id], :include => [:guardians]
    @guardian = Guardian.new params[:guardian]
    if request.post? and @guardian.save
---
SELECT * FROM `students` WHERE (`students`.`id` = 33)
SELECT `guardians`.* FROM `guardians` WHERE (`guardians`.ward_id = 33)
INSERT INTO `guardians` (`city`, `chinese_name`, `email`, `user_id`, `ward_id`, `relation`, `office_phone1`, `office_phone2`, `updated_at`, `state`, `country_id`, `dob`, `created_at`, `first_name`, `office_address_line1`, `office_address_line2`, `occupation`, `income`, `last_name`, `mobile_phone`, `education`) VALUES('', '', '', NULL, 34, 'Father', NULL, NULL, '2014-04-01 06:42:03', '', 36, NULL, '2014-04-01 06:42:03', 'woehoiw', '', '', NULL, NULL, 'aeoihawioe', '', NULL)

  def admission3
    @student = Student.find(params[:id])
    @parents = @student.guardians
    if @parents.empty?
      redirect_to :controller => "student", :action => "previous_data", :id => @student.id
    end
    return if params[:immediate_contact].nil?
    if request.post?
      sms_setting = SmsSetting.new()
      @student = Student.update(@student.id, :immediate_contact_id => params[:immediate_contact][:contact])
      if sms_setting.application_sms_active and @student.is_sms_enabled
        recipients = []
        message = "#{t('student_admission_done')}  #{@student.admission_no} #{t('password_is')} #{@student.admission_no}123"
        if sms_setting.parent_sms_active
          guardian = Guardian.find(@student.immediate_contact_id)
---
SELECT * FROM `students` WHERE (`students`.`id` = 34)
SELECT * FROM `guardians` WHERE (`guardians`.ward_id = 34)
SELECT count(*) AS count_all FROM `guardians` WHERE (`guardians`.ward_id = 34)
UPDATE `guardians` SET `user_id` = 56, `updated_at` = '2014-04-01 06:42:09' WHERE `id` = 12
UPDATE `students` SET `updated_at` = '2014-04-01 06:42:09', `immediate_contact_id` = 12 WHERE `id` = 34
SELECT * FROM `guardians` WHERE (`guardians`.`id` = 12)
SELECT `students`.id FROM `students` WHERE (`students`.`admission_no` = BINARY 'Student5' AND `students`.id <> 34) LIMIT 1

  def previous_data
    @student = Student.find(params[:id])
    @previous_data = StudentPreviousData.new params[:student_previous_details]
    @previous_subject = StudentPreviousSubjectMark.find_all_by_student_id(@student)
---
SELECT * FROM `students` WHERE (`students`.`id` = 34)
SELECT * FROM `student_previous_subject_marks` WHERE (`student_previous_subject_marks`.`student_id` = 34)

  def admission4
    @student = Student.find(params[:id])
    @additional_fields = StudentAdditionalField.find(:all, :conditions=> "status = true")
---
SELECT * FROM `students` WHERE (`students`.`id` = 34)
SELECT * FROM `student_additional_fields` WHERE (status = true)

  def list_students_by_course
    @students = Student.find_all_by_batch_id(params[:batch_id], :order => 'first_name ASC')
---
SELECT * FROM `students` WHERE (`students`.`batch_id` = '2') ORDER BY first_name ASC

  def profile
    @current_user = current_user
    @address = @student.address_line1.to_s + ' ' + @student.address_line2.to_s
    @contactlog_last = ContactLog.find(:all, :conditions => ["admission_no = ?", @student.admission_no]).last
    @additional_fields = StudentAdditionalField.all(:conditions=>"status = true")
    @sms_module = Configuration.available_modules
    @sms_setting = SmsSetting.new
    @previous_data = StudentPreviousData.find_by_student_id(@student.id)
    @immediate_contact = Guardian.find(@student.immediate_contact_id) \
      unless @student.immediate_contact_id.nil? or @student.immediate_contact_id == ''
---
SELECT * FROM `contact_logs` WHERE (admission_no = '123476')
SELECT * FROM `student_additional_fields` WHERE (status = true)
SELECT * FROM `student_previous_datas` WHERE (`student_previous_datas`.`student_id` = 21) LIMIT 1
SELECT * FROM `guardians` WHERE (`guardians`.`id` = 3)
SELECT * FROM `students` WHERE (`students`.user_id = 26) LIMIT 1

  def find_student
    @student = Student.find params[:id]
---
SELECT * FROM `students` ORDER BY students.id DESC LIMIT 1